In [2]:
f = open('mytext.txt','w')

f.write("안녕하세요. 첫 줄 입니다.")
f.close()

In [6]:
r = open('mytext.txt','r')
r.readline()

'안녕하세요. 첫 줄 입니다.'

In [ ]:
# with문

with open("mytext.txt",'r')as f : 
print(f.read())

## pandas

- 데이터 분석 라이브러리

import pandas as pd

In [12]:
import pandas as pd

In [14]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [17]:
df = pd.DataFrame(    {
    "name":["tom", "sally","yujin","carl"],
    "age":[30,31,23,40],
    "location": ["seoul","seoul","ilsan","Newyork"],
    "e-mail" : ["tom@naver.com", None, None, None]

        }
)

df

    name  age location         e-mail
0    tom   30    seoul  tom@naver.com
1  sally   31    seoul           None
2  yujin   23    ilsan           None
3   carl   40  Newyork           None

In [28]:
pd.DataFrame(
    [
    {"name":"tom", "age":30, "location":"seoul", "e-mail":"tom@naver.com"},
    {"name":"sally", "age":31, "location":"seoul","e-mail":None},
    {"name":"yujin","age":23,"location":"ilsan","e-mail":None},
    {"name":"carl","age":40,"location":"Newyork","e-mail":None}
    
    ]
)

    name  age location         e-mail
0    tom   30    seoul  tom@naver.com
1  sally   31    seoul           None
2  yujin   23    ilsan           None
3   carl   40  Newyork           None

In [27]:
df.loc[1,'e-mail']='sally@daum.net'

df

    name  age location          e-mail
0    tom   30    seoul   tom@naver.com
1  sally   31    seoul  sally@daum.net
2  yujin   23    ilsan            None
3   carl   40  Newyork            None

In [ ]:

 중괄호가 딕셔너리 / 대괄호가 리스트

df = pd.DataFrame({
    "name":["tom","sally","yujin","carl"],
    "age":[30,31,23,40],
    "location":["seoul","seoul","ilsan","Newyork"],
    "e-mail":["tom@naver.com","sally@naver.com", None, None]
})

In [ ]:
= pd.Dataframe()

In [1]:
## pandas - 기능들

In [6]:
import pandas as pd

df = df = pd.DataFrame({
    "name":["tom", "sally","yujin","carl"],
    "age":[30,31,23,40],
    "location": ["seoul","seoul","ilsan","Newyork"],
    "e-mail" : ["tom@naver.com", None, None, None]
        })

df

    name  age location         e-mail
0    tom   30    seoul  tom@naver.com
1  sally   31    seoul           None
2  yujin   23    ilsan           None
3   carl   40  Newyork           None

In [8]:
df["Id"] = range(1, len(df)+1)

df

    name  age location         e-mail  Id
0    tom   30    seoul  tom@naver.com   1
1  sally   31    seoul           None   2
2  yujin   23    ilsan           None   3
3   carl   40  Newyork           None   4

In [9]:
df['name']

0      tom
1    sally
2    yujin
3     carl
Name: name, dtype: object

In [10]:
mames = pd.Series(['tom','sally','yujin','carl'])

In [ ]:
## concat

-

In [ ]:
## merge

-inner join : 키가 일치하는 것들에 대해서만 합친다 
-outer join : 키가 일치하지 않아도 합쳐준다 
-left or right join : 왼쪽 혹은 오른쪽에 데이터의 키값만 합쳐준다

In [11]:
newData = pd.DataFrame([{"name":"hoi", "age":27, "location":"Pusan"}], index=[4])

newData

  name  age location
4  hoi   27    Pusan

In [12]:
df = pd.concat([df, newData], axis = 0, ignore_index=True)

In [13]:
newData = pd.DataFrame({
    "name":["tom","yujin","sally","carl"],
    "hobby":["soccer","soccer","baseball", "reading"]
})

In [14]:
msk = df.duplicated()
~msk, msk
df = df[~msk]

In [15]:
df.loc[1:3, "name"], df.iloc[1:4, 0]

(1    sally
 2    yujin
 3     carl
 Name: name, dtype: object,
 1    sally
 2    yujin
 3     carl
 Name: name, dtype: object)

In [16]:
newData

    name     hobby
0    tom    soccer
1  yujin    soccer
2  sally  baseball
3   carl   reading

In [17]:
df.merge(newData, how="inner")

    name  age location         e-mail   Id     hobby
0    tom   30    seoul  tom@naver.com  1.0    soccer
1  sally   31    seoul           None  2.0  baseball
2  yujin   23    ilsan           None  3.0    soccer
3   carl   40  Newyork           None  4.0   reading

In [18]:

df

    name  age location         e-mail   Id
0    tom   30    seoul  tom@naver.com  1.0
1  sally   31    seoul           None  2.0
2  yujin   23    ilsan           None  3.0
3   carl   40  Newyork           None  4.0
4    hoi   27    Pusan            NaN  NaN

In [19]:
df.merge(newData, how="inner")

    name  age location         e-mail   Id     hobby
0    tom   30    seoul  tom@naver.com  1.0    soccer
1  sally   31    seoul           None  2.0  baseball
2  yujin   23    ilsan           None  3.0    soccer
3   carl   40  Newyork           None  4.0   reading

In [ ]:
# apply funtion
- 단위컬럼 또는 여러컬럼에 대해서 어떤 연산을 적용하고 싶을 때 
- 새로운 컬럼을 만들어 내고 싶을 때

In [20]:
df

    name  age location         e-mail   Id
0    tom   30    seoul  tom@naver.com  1.0
1  sally   31    seoul           None  2.0
2  yujin   23    ilsan           None  3.0
3   carl   40  Newyork           None  4.0
4    hoi   27    Pusan            NaN  NaN

In [ ]:
df.apply

In [21]:
## groupby
 - 특정 컬럼의 중복되는 데이터를 합쳐서 새로운 데이터 프레임으로 재구조화 
- size, min , max , mean 등 다양한 기능들이 있음 

df

IndentationError: unexpected indent (58126366.py, line 2)

In [22]:
df

    name  age location         e-mail   Id
0    tom   30    seoul  tom@naver.com  1.0
1  sally   31    seoul           None  2.0
2  yujin   23    ilsan           None  3.0
3   carl   40  Newyork           None  4.0
4    hoi   27    Pusan            NaN  NaN

In [23]:
df['group1]

SyntaxError: EOL while scanning string literal (1144747212.py, line 1)

In [24]:
df

    name  age location         e-mail   Id
0    tom   30    seoul  tom@naver.com  1.0
1  sally   31    seoul           None  2.0
2  yujin   23    ilsan           None  3.0
3   carl   40  Newyork           None  4.0
4    hoi   27    Pusan            NaN  NaN

In [25]:
df.describe()

             age        Id
count   5.000000  4.000000
mean   30.200000  2.500000
std     6.300794  1.290994
min    23.000000  1.000000
25%    27.000000  1.750000
50%    30.000000  2.500000
75%    31.000000  3.250000
max    40.000000  4.000000